#language: ru

@tree

Функционал: Проверка заполнения полей

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка заполнения полей
И Я устанавливаю в константу "UseCompanies" значение "False"
Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
Когда открылось окно "Заказы покупателей"
И я нажимаю на кнопку с именем 'FormCreate'
Тогда открылось окно "Заказ покупателя (создание)"
И я нажимаю кнопку выбора у поля с именем 'Partner'
Тогда открылось окно "Партнеры"
И в таблице 'List' я активизирую поле с именем 'Description'
И в таблице 'List' я выбираю текущую строку
Тогда открылось окно "Заказ покупателя (создание) *"
И в таблице 'ItemList' я активизирую поле с именем 'ItemListLineNumber'
И в таблице 'ItemList' я нажимаю на кнопку с именем 'ItemListAdd'
И в таблице 'ItemList' я нажимаю кнопку выбора у реквизита с именем 'ItemListPartnerItem'
Тогда открылось окно "Номенклатура партнера"
И в таблице 'List' я активизирую поле с именем 'Description'
И в таблице 'List' я выбираю текущую строку
Тогда открылось окно "Заказ покупателя (создание) *"
И в таблице 'ItemList' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'FormPostAndClose'