#language: ru

@tree

Функционал: Проверка картинок 

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка картинок

И я закрываю все окна клиентского приложения
Дано Я открываю навигационную ссылку "e1cib/list/Справочник.Товары"
Когда открылось окно "Товары"
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Босоножки (Товар)"
Когда открылось окно "Босоножки (Товар)"
И я нажимаю на кнопку с именем 'ОбновитьКартинку'
