#language: ru

@tree

Функционал: Проверка отображения возвратов D2001

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка отображения возвратов D2001
Дано Я открываю навигационную ссылку "e1cib/app/Report.D2001_Sales" 
Когда открылось окно "D2001 Продажи"
И я нажимаю на кнопку с именем 'FormGenerate'
И я нажимаю на кнопку с именем 'FormGenerate'
И я жду, что табличный документ 'Result' заполнится данными в течение 10 секунд
И табличный документ "Result" содержит строки только из макета "Макет_для_проверки_D2001" по шаблону
