#language: ru

@tree

Функционал: Проверка расхода товара по регистрам

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка расхода товара по регистрам
И я закрываю все окна клиентского приложения
И В командном интерфейсе я выбираю "Продажи" "Документы продаж"
Тогда открылось окно "Документы продаж"
И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруЗаказ'
Тогда открылось окно "Заказ (создание)"
И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\""
И из выпадающего списка с именем 'Покупатель' я выбираю точное значение "Магазин \"Продукты\""
И из выпадающего списка с именем 'Склад' я выбираю точное значение "Малый"
И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Торт "
И я перехожу к следующему реквизиту
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10"
И в таблице 'Товары' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Заказ (создание) *" в течение 20 секунд
Когда открылось окно "Документы продаж" 
И в таблице 'Список' я активизирую поле с именем 'Дата'
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Заказ * от *"
И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараСоздатьНаОсновании'
Тогда открылось окно "Продажа товара (создание)"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Продажа товара (создание)" в течение 20 секунд
Дано Я открываю навигационную ссылку "e1cib/list/ЖурналДокументов.ДокументыПродаж"
Тогда таблица 'Список' содержит строки:
	| 'Дата'                | 'Номер'     | 'Тип документа' | 'Покупатель'                | 'Склад'               | 'Валюта' | 'Вид цен'      | 'Организация'        | 'Состояние заказа' |
	| '26.04.2023 8:58:38'  | '000000018' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '26.04.2023 8:58:38'  | '000000019' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '26.04.2023 21:10:38' | '000000001' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Большой'             | ''       | 'Мелкооптовая' | 'ООО "1000 мелочей"' | 'Закрыт'           |
	| '26.04.2023 21:13:38' | '000000001' | 'Продажа'       | 'Магазин "Бытовая техника"' | 'Большой'             | ''       | 'Мелкооптовая' | 'ООО "1000 мелочей"' | ''                 |
	| '27.04.2023 8:58:38'  | '000000020' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '27.04.2023 8:58:38'  | '000000021' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '28.04.2023 1:12:17'  | '000000002' | 'Заказ'         | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Закрыт'           |
	| '28.04.2023 1:12:38'  | '000000002' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | ''                 |
	| '28.04.2023 3:13:56'  | '000000003' | 'Заказ'         | 'Шлюзовая ООО'              | 'Большой'             | 'USD'    | 'Закупочная'   | 'ООО "Товары"'       | 'Закрыт'           |
	| '28.04.2023 4:14:40'  | '000000004' | 'Заказ'         | 'Магазин "Обувь"'           | 'Малый'               | ''       | 'Розничная'    | 'ООО "1000 мелочей"' | 'Закрыт'           |
	| '28.04.2023 8:58:38'  | '000000022' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '28.04.2023 8:58:38'  | '000000023' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '29.04.2023 3:14:16'  | '000000003' | 'Продажа'       | 'Шлюзовая ООО'              | 'Большой'             | 'USD'    | 'Закупочная'   | 'ООО "Товары"'       | ''                 |
	| '29.04.2023 8:58:38'  | '000000024' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '29.04.2023 8:58:38'  | '000000025' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '30.04.2023 4:16:28'  | '000000004' | 'Продажа'       | 'Магазин "Обувь"'           | 'Малый'               | ''       | 'Розничная'    | 'ООО "1000 мелочей"' | ''                 |
	| '30.04.2023 8:58:38'  | '000000026' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '30.04.2023 8:58:38'  | '000000027' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '01.05.2023 4:16:29'  | '000000005' | 'Заказ'         | 'Попов Б.В. ИЧП '           | 'Большой'             | ''       | 'Мелкооптовая' | 'ООО "1000 мелочей"' | 'Закрыт'           |
	| '01.05.2023 4:16:33'  | '000000005' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Большой'             | ''       | 'Мелкооптовая' | 'ООО "1000 мелочей"' | ''                 |
	| '01.05.2023 8:58:38'  | '000000028' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '01.05.2023 8:58:38'  | '000000029' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '01.05.2023 23:23:38' | '000000006' | 'Заказ'         | 'Попов Б.В. ИЧП '           | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | 'Закрыт'           |
	| '01.05.2023 23:27:38' | '000000006' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '02.05.2023 8:58:38'  | '000000030' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '02.05.2023 8:58:38'  | '000000031' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '02.05.2023 19:13:38' | '000000007' | 'Заказ'         | 'Шлюзовая ООО'              | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Закрыт'           |
	| '02.05.2023 19:13:50' | '000000007' | 'Продажа'       | 'Шлюзовая ООО'              | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | ''                 |
	| '03.05.2023 8:58:38'  | '000000032' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '03.05.2023 8:58:38'  | '000000033' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '04.05.2023 8:58:38'  | '000000034' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '04.05.2023 8:58:38'  | '000000035' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '05.05.2023 8:58:38'  | '000000036' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '05.05.2023 8:58:38'  | '000000037' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '05.05.2023 21:33:50' | '000000008' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Закрыт'           |
	| '05.05.2023 21:35:50' | '000000008' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | ''                 |
	| '06.05.2023 8:58:38'  | '000000038' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '06.05.2023 8:58:38'  | '000000039' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '07.05.2023 8:58:38'  | '000000040' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '07.05.2023 8:58:38'  | '000000041' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '08.05.2023 8:58:38'  | '000000042' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '08.05.2023 8:58:38'  | '000000043' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '08.05.2023 23:13:38' | '000000009' | 'Заказ'         | 'Попов Б.В. ИЧП '           | 'Большой'             | ''       | 'Мелкооптовая' | 'ООО "1000 мелочей"' | 'Закрыт'           |
	| '08.05.2023 23:14:08' | '000000009' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Большой'             | ''       | 'Мелкооптовая' | 'ООО "1000 мелочей"' | ''                 |
	| '09.05.2023 8:58:38'  | '000000044' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '09.05.2023 8:58:38'  | '000000045' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '10.05.2023 8:58:38'  | '000000046' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '10.05.2023 8:58:38'  | '000000047' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '11.05.2023 8:58:38'  | '000000048' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '11.05.2023 8:58:38'  | '000000049' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '12.05.2023 8:58:38'  | '000000050' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '12.05.2023 8:58:38'  | '000000051' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '13.05.2023 8:58:38'  | '000000052' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '13.05.2023 8:58:38'  | '000000053' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '13.05.2023 21:24:18' | '000000010' | 'Заказ'         | 'Попов Б.В. ИЧП '           | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | 'Закрыт'           |
	| '13.05.2023 21:24:33' | '000000010' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '14.05.2023 8:58:38'  | '000000054' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '14.05.2023 8:58:38'  | '000000055' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '15.05.2023 8:58:38'  | '000000056' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '15.05.2023 8:58:38'  | '000000057' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '16.05.2023 8:58:38'  | '000000058' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '16.05.2023 8:58:38'  | '000000059' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '17.05.2023 8:58:38'  | '000000060' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '17.05.2023 8:58:38'  | '000000061' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '18.05.2023 8:58:38'  | '000000062' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '18.05.2023 8:58:38'  | '000000063' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '19.05.2023 8:58:38'  | '000000064' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '19.05.2023 8:58:38'  | '000000065' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '20.05.2023 8:58:38'  | '000000066' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '20.05.2023 8:58:38'  | '000000067' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '21.05.2023 8:58:38'  | '000000068' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '21.05.2023 8:58:38'  | '000000069' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '22.05.2023 8:58:38'  | '000000070' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '22.05.2023 8:58:38'  | '000000071' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '23.05.2023 8:58:38'  | '000000072' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '23.05.2023 8:58:38'  | '000000073' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '24.05.2023 8:58:38'  | '000000074' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '24.05.2023 8:58:38'  | '000000075' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '25.05.2023 8:58:38'  | '000000076' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '25.05.2023 8:58:38'  | '000000077' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '26.05.2023 8:58:38'  | '000000078' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '26.05.2023 8:58:38'  | '000000079' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '27.05.2023 8:58:38'  | '000000080' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '27.05.2023 8:58:38'  | '000000081' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '28.05.2023 8:58:38'  | '000000082' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '28.05.2023 8:58:38'  | '000000083' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '29.05.2023 8:58:38'  | '000000084' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '29.05.2023 8:58:38'  | '000000085' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '29.05.2023 23:23:40' | '000000011' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Выполнен'         |
	| '29.05.2023 23:23:53' | '000000011' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | ''                 |
	| '30.05.2023 8:58:38'  | '000000086' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '30.05.2023 8:58:38'  | '000000087' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '30.05.2023 19:14:03' | '000000012' | 'Заказ'         | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Выполнен'         |
	| '30.05.2023 19:19:03' | '000000012' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | ''                 |
	| '31.05.2023 8:58:38'  | '000000088' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '31.05.2023 8:58:38'  | '000000089' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '31.05.2023 20:58:38' | '000000013' | 'Заказ'         | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Выполнен'         |
	| '31.05.2023 21:03:38' | '000000013' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | ''                 |
	| '31.05.2023 22:44:28' | '000000014' | 'Заказ'         | 'Попов Б.В. ИЧП '           | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "1000 мелочей"' | 'В работе'         |
	| '31.05.2023 22:45:28' | '000000014' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "1000 мелочей"' | ''                 |
	| '01.06.2023 8:58:38'  | '000000090' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '01.06.2023 8:58:38'  | '000000091' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '01.06.2023 18:23:50' | '000000015' | 'Заказ'         | 'Шлюзовая ООО'              | 'Средний'             | 'Рубли'  | 'Оптовая'      | 'ООО "Товары"'       | 'В работе'         |
	| '01.06.2023 18:28:50' | '000000015' | 'Продажа'       | 'Шлюзовая ООО'              | 'Средний'             | 'Рубли'  | 'Оптовая'      | 'ООО "Товары"'       | ''                 |
	| '02.06.2023 8:58:38'  | '000000092' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '02.06.2023 8:58:38'  | '000000093' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '02.06.2023 8:58:39'  | '000000103' | 'Продажа'       | 'Магазин "Бытовая техника"' | 'Склад отдела продаж' | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | ''                 |
	| '03.06.2023 8:58:38'  | '000000094' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '03.06.2023 8:58:38'  | '000000095' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '03.06.2023 8:58:39'  | '000000102' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Средний'             | 'Рубли'  | 'Розничная'    | 'ООО "Товары"'       | ''                 |
	| '04.06.2023 8:58:38'  | '000000096' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '04.06.2023 8:58:38'  | '000000097' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '04.06.2023 8:58:39'  | '000000104' | 'Продажа'       | 'Магазин "Бытовая техника"' | 'Склад отдела продаж' | 'Рубли'  | 'Розничная'    | 'ООО "Все для дома"' | ''                 |
	| '05.06.2023 8:58:38'  | '000000098' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '05.06.2023 8:58:38'  | '000000099' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '05.06.2023 23:20:18' | '000000016' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Товары"'       | 'В работе'         |
	| '05.06.2023 23:20:33' | '000000016' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Товары"'       | ''                 |
	| '06.06.2023 8:58:38'  | '000000100' | 'Продажа'       | 'Магазин "Мясная лавка"'    | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '06.06.2023 8:58:38'  | '000000101' | 'Продажа'       | 'Магазин "Продукты"'        | 'Большой'             | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '06.06.2023 8:58:39'  | '000000105' | 'Продажа'       | 'Магазин "Бытовая техника"' | 'Склад отдела продаж' | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | ''                 |
	| '08.06.2023 0:29:03'  | '000000017' | 'Заказ'         | 'Попов Б.В. ИЧП '           | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'В работе'         |
	| '08.06.2023 0:29:23'  | '000000017' | 'Продажа'       | 'Попов Б.В. ИЧП '           | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | ''                 |
	| '08.06.2023 0:29:24'  | '000000106' | 'Продажа'       | 'Магазин "Бытовая техника"' | 'Склад отдела продаж' | 'Рубли'  | 'Мелкооптовая' | 'ООО "Товары"'       | ''                 |
	| '08.06.2023 19:13:38' | '000000018' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Товары"'       | 'Открыт'           |
	| '08.06.2023 23:37:46' | '000000019' | 'Заказ'         | 'Магазин "Обувь"'           | 'Малый'               | 'Рубли'  | 'Розничная'    | 'ООО "Все для дома"' | 'Открыт'           |
	| '09.06.2023 0:00:00'  | '000000020' | 'Заказ'         | 'Магазин "Продукты"'        | 'Средний'             | 'Рубли'  | 'Оптовая'      | 'ООО "Товары"'       | 'Открыт'           |
	| '02.06.2025 16:30:24' | '000000021' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:30:44' | '000000022' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:31:48' | '000000023' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:34:43' | '000000024' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:35:30' | '000000025' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:36:47' | '000000026' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:38:12' | '000000027' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:42:52' | '000000028' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:46:03' | '000000029' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:46:48' | '000000030' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:47:27' | '000000031' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:52:39' | '000000032' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:52:53' | '000000033' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:57:17' | '000000034' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:59:13' | '000000035' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 16:59:46' | '000000036' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:19:34' | '000000037' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:19:49' | '000000038' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:20:43' | '000000039' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:20:54' | '000000040' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:21:58' | '000000041' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:23:38' | '000000042' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:50:49' | '000000043' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:55:08' | '000000044' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:56:14' | '000000045' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:56:40' | '000000046' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:57:57' | '000000047' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:58:22' | '000000048' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:59:06' | '000000049' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 17:59:35' | '000000050' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 18:07:44' | '000000051' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 18:08:40' | '000000052' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '02.06.2025 18:10:54' | '000000053' | 'Заказ'         | 'Магазин "Бытовая техника"' | 'Малый'               | 'Рубли'  | 'Мелкооптовая' | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 9:23:05'  | '000000054' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 9:23:54'  | '000000055' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 17:08:34' | '000000056' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 17:09:09' | '000000057' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 17:11:16' | '000000058' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 17:48:42' | '000000059' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '03.06.2025 18:21:21' | '000000060' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | 'Рубли'  | 'Оптовая'      | 'ООО "Все для дома"' | 'Открыт'           |
	| '24.06.2025 16:31:01' | '000000061' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:36:36' | '000000062' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:36:53' | '000000107' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | ''                 |
	| '24.06.2025 16:42:11' | '000000063' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:42:31' | '000000108' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | ''                 |
	| '24.06.2025 16:45:21' | '000000064' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:46:00' | '000000109' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | ''                 |
	| '24.06.2025 16:47:07' | '000000065' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:47:08' | '000000110' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | ''                 |
	| '24.06.2025 16:49:01' | '000000066' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:49:02' | '000000111' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | ''                 |
	| '24.06.2025 16:50:05' | '000000067' | 'Заказ'         | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | 'Открыт'           |
	| '24.06.2025 16:50:06' | '000000112' | 'Продажа'       | 'Магазин "Продукты"'        | 'Малый'               | ''       | 'Оптовая'      | 'ООО "1000 мелочей"' | ''                 |

