#language: ru

@tree

Функционал: Тест заказов покупателя


Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Тест заказов покупателя

Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
Когда открылось окно "Заказы покупателей"
И я нажимаю на кнопку с именем 'FormCreate'
Тогда открылось окно "Заказ покупателя (создание)"
И я нажимаю кнопку выбора у поля с именем 'Partner'
Тогда открылось окно "Партнеры"
И в таблице 'List' я перехожу к строке:
	| "Код" | "Наименование"            |
	| "2"   | "Клиент 2 (2 соглашения)" |
И в таблице 'List' я активизирую поле с именем 'Description'
И в таблице 'List' я выбираю текущую строку
Тогда открылось окно "Заказ покупателя (создание) *"
И в таблице 'ItemList' я активизирую поле с именем 'ItemListLineNumber'
И я нажимаю кнопку выбора у поля с именем 'Agreement'
Тогда открылось окно "Соглашения"
И в таблице 'List' я активизирую поле с именем 'Description'
И в таблице 'List' я выбираю текущую строку
Тогда открылось окно "Заказ покупателя (создание) *"
И в таблице 'ItemList' я активизирую поле с именем 'ItemListLineNumber'
И в таблице 'ItemList' я нажимаю на кнопку с именем 'ItemListAdd'
И в таблице 'ItemList' я нажимаю кнопку выбора у реквизита с именем 'ItemListPartnerItem'
Тогда открылось окно "Номенклатура партнера"
И в таблице 'List' я перехожу к строке:
	| "Description"                                          | "Артикул" | "Код" | "Номенклатура"             | "Партнер"     | "Ссылка"                                               | "Характеристика" |
	| "Номенклатура поставщика 2 (товар с характеристиками)" | "AM15009" | "2"   | "Товар с характеристиками" | "Поставщик 2" | "Номенклатура поставщика 2 (товар с характеристиками)" | "S/Красный"      |
И в таблице 'List' я активизирую поле с именем 'Description'
И в таблице 'List' я выбираю текущую строку
Тогда открылось окно "Заказ покупателя (создание) *"
И в таблице 'ItemList' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'FormPostAndClose'
И я жду закрытия окна "Заказ покупателя (создание) *" в течение 20 секунд
Тогда таблица 'List' содержит строки:
	| 'Номер' | 'Дата'                | 'Завершен' | 'Партнер'                 | 'Статус'      | 'Σ'        | 'Валюта' | 'Организация'            | 'Склад'                         | 'Автор' | 'Ссылка'                                     | 'Закрытие заказа'                                    |
	| '1'     | '24.02.2021 10:13:53' | 'Да'       | 'Клиент 2 (2 соглашения)' | 'Согласовано' | '1 400,00' | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 1 от 24.02.2021 10:13:53'  | 'Закрытие заказа покупателя 1 от 22.07.2021 9:15:12' |
	| '2'     | '24.02.2021 11:13:25' | 'Нет'      | 'Клиент 1 (1 соглашение)' | 'Согласовано' | '2 835,00' | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 2 от 24.02.2021 11:13:25'  | ''                                                   |
	| '3'     | '25.02.2021 12:00:00' | 'Нет'      | 'Клиент 2 (2 соглашения)' | 'Согласовано' | '3 300,00' | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 3 от 25.02.2021 12:00:00'  | ''                                                   |
	| '4'     | '16.06.2025 17:15:24' | 'Нет'      | 'Клиент 1 (1 соглашение)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 4 от 16.06.2025 17:15:24'  | ''                                                   |
	| '5'     | '16.06.2025 18:10:10' | 'Нет'      | 'Клиент 1 (1 соглашение)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 5 от 16.06.2025 18:10:10'  | ''                                                   |
	| '6'     | '16.06.2025 18:11:53' | 'Нет'      | 'Клиент 1 (1 соглашение)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 6 от 16.06.2025 18:11:53'  | ''                                                   |
	| '7'     | '20.06.2025 12:04:15' | 'Нет'      | 'Клиент 1 (1 соглашение)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 7 от 20.06.2025 12:04:15'  | ''                                                   |
	| '8'     | '20.06.2025 12:38:30' | 'Нет'      | 'Клиент 1 (1 соглашение)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 8 от 20.06.2025 12:38:30'  | ''                                                   |
	| '9'     | '23.06.2025 14:38:59' | 'Нет'      | 'Клиент 2 (2 соглашения)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 9 от 23.06.2025 14:38:59'  | ''                                                   |
	| '10'    | '23.06.2025 14:43:39' | 'Нет'      | 'Клиент 2 (2 соглашения)' | 'Согласовано' | '190,00'   | 'USD'    | 'Собственная компания 1' | 'Склад 1 (с контролем остатка)' | 'CI'    | 'Заказ покупателя 10 от 23.06.2025 14:43:39' | ''                                                   |


